{
    "projects": [
        {
            "id": 1,
            "name": "Yu-Gi-Oh",
            "link": "https://yu-gi-oh-card-info.vercel.app",
            "banner": "../banners/yu-gi-oh.jpg",
            "thumbnail": "../thumbnails/yu-gi-oh.png",
            "description": "Este foi o meu primeiro projeto para valer! Assumo que não nada fácil, aprendi muita coisa com ele, e sinceramente fiquei muito feliz com o resultado. Ele foi construindo em JavaScript PURO, por isso tive tanto trabalho, principalmente porque foi bem no início, onde eu decidi começar a colocar em prática meus estudos, como consumo de APIs e sem saber acabei encontrando essa API que é muito grande. Foi uma grande realização."
        },
        {
            "id": 2,
            "name": "Tree",
            "link": "https://tree-app-renovatt.vercel.app/login",
            "banner": "../banners/tree.png",
            "thumbnail": "../thumbnails/tree.png",
            "description": "Desenvolvi um aplicativo de finanças para atender minhas necessidades pessoais. Ele permite registrar despesas de forma segura e acessí-las de qualquer lugar, além de oferecer filtragem por mês e ano, visualização de faturamentos dos últimos 6 meses, campos para anotações e lista de prioridades."
        },
        {
            "id": 3,
            "name": "Pokédex-React",
            "link": "https://pokedex-snowy-seven.vercel.app",
            "banner": "../banners/pokedex.png",
            "thumbnail": "../thumbnails/pokedex.png",
            "description": "Finalmente cheguei ao React! E claro como todo e bom programador iniciante, criei a minha própria Pokedex. Já tinha criado antes com JavaScript puro, mas ficou bem simples, neste aqui tentei deixar bem mais atraente, com mecanismo de buscas e tratamentos de erros."
        },
        {
            "id": 4,
            "name": "Valorant",
            "link": "https://valorant-self.vercel.app",
            "banner": "../banners/valorant.png",
            "thumbnail": "../thumbnails/valorant.png",
            "description": "Tive a ideia de consumir a API de um dos jogos mais famosos, estou renderizando algumas informações sobre o game, personagens com suas descrições, incluindo vozes e vídeos das habilidades, apresentações de todas as armas, suas especificações e os mapas presentes no jogo. Um quase completo guia do jogo."
        },
        {
            "id": 5,
            "name": "Relógio Dinâmico",
            "link": "https://renovatt.github.io/relogio-dinamico",
            "banner": "../banners/clock.png",
            "thumbnail": "../thumbnails/clock.png",
            "description": "No início fiquei fazendo vários pequenos projetos, e este foi um deles, poderia ser mais atraente, mas como foi bem no começo, foi o que consegui criar naquele momento. A ideia era replicar um relógio que segue o dia a dia de uma pessoa, acordando, indo ao trabalho, horário de almoço, voltando para casa, lazer e dormindo."
        },
        {
            "id": 6,
            "name": "Dogs",
            "link": "https://dogs-weld.vercel.app",
            "banner": "../banners/dogs.png",
            "thumbnail": "../thumbnails/dogs.png",
            "description": "Este projeto não foi algo criado por mim do zero como meus outros projetos, mas criei por estudo, aprendi bastante coisa. Ele se trata de uma rede social para cachorros criada no curso de React da Origamid."
        },
        {
            "id": 0,
            "name": "Em breve",
            "link": "#",
            "banner": "../banners/default.png",
            "thumbnail": "../thumbnails/thumbnail.png",
            "description": "Em breve, estou construindo algo."
        }
    ],
    "softskills": [
        {
            "id": 1,
            "name": "Organização"
        },
        {
            "id": 2,
            "name": "Colaboração"
        },
        {
            "id": 3,
            "name": "Esforçado"
        },
        {
            "id": 4,
            "name": "Comunicação"
        },
        {
            "id": 5,
            "name": "Gosto de Aprender"
        },
        {
            "id": 6,
            "name": "Trabalho em Equipe"
        },
        {
            "id": 7,
            "name": "Dedicação"
        },
        {
            "id": 8,
            "name": "Compromisso"
        }
    ]
}