{
    "projects": [
        {
            "id": 1,
            "name": "Cute Pet",
            "link": "https://schedule-petshop-system.vercel.app",
            "banner": "../banners/cutepet.png",
            "thumbnail": "../thumbnails/cutepet.png",
            "description": "O Cute Pet é um sistema completo de agendamento de petshop, desenvolvido com a tecnologia Next.js e TypeScript. Com ele, é possível cadastrar clientes e seus pets, bem como agendar atendimentos e atualizar as informações cadastradas a qualquer momento. Com uma interface amigável e intuitiva, o Cute Pet oferece uma experiência de uso agradável e eficiente para seus usuários. Além disso, o sistema conta com um banco de dados robusto, desenvolvido com Node.js, Prisma e MongoDB, o que garante alta performance e escalabilidade."
        },
        {
            "id": 2,
            "name": "Tree Finance",
            "link": "https://tree-app-renovatt.vercel.app/login",
            "banner": "../banners/tree.png",
            "thumbnail": "../thumbnails/tree.png",
            "description": "Desenvolvi um aplicativo de finanças para atender minhas necessidades pessoais. Ele permite registrar despesas de forma segura e acessí-las de qualquer lugar, além de oferecer filtragem por mês e ano, visualização de faturamentos dos últimos 6 meses, campos para anotações e lista de prioridades."
        },
        {
            "id": 3,
            "name": "Yu-Gi-Oh",
            "link": "https://yu-gi-oh-cards-renovatt.vercel.app",
            "banner": "../banners/yu-gi-oh.png",
            "thumbnail": "../thumbnails/yu-gi-oh.png",
            "description": "Eu recriei este projeto como uma homenagem ao meu primeiro trabalho, que me ajudou a alavancar na programação. Construí uma interface ainda básica, porém mais funcional, fluída e dinâmica. Com uma versão aprimorada do meu primeiro projeto, ele é dedicado aos fãs do anime e do jogo YuGiOh, fornecendo informações detalhadas sobre todas as cartas. Dessa vez, o projeto foi construído usando Next.js e TypeScript, o que permitiu a criação de rotas dinâmicas para cada carta selecionada, campo de busca eficiente e opções para continuar buscando cartas na lista de nomes ou nas imagens."
        },
        {
            "id": 4,
            "name": "Pokédex",
            "link": "https://pokedex-snowy-seven.vercel.app",
            "banner": "../banners/pokedex.png",
            "thumbnail": "../thumbnails/pokedex.png",
            "description": "Finalmente cheguei ao React! E claro como todo e bom programador iniciante, criei a minha própria Pokedex. Já tinha criado antes com JavaScript puro, mas ficou bem simples, neste aqui tentei deixar bem mais atraente, com mecanismo de buscas e tratamentos de erros."
        },
        {
            "id": 5,
            "name": "Cute Pet API",
            "link": "https://github.com/renovatt/petshop-system-api.git",
            "banner": "../banners/cutepet-api.png",
            "thumbnail": "../thumbnails/cutepet.png",
            "description": "Essa API foi criada para permitir que os donos de petshops agendem serviços para os pets de seus clientes. Com esta API, os usuários Donos de PetShops podem realizar as seguintes ações: criar, ler, atualizar e excluir usuários, clientes, agendamentos e agendamentos cancelados."
        },
        {
            "id": 6,
            "name": "Valorant",
            "link": "https://valorant-self.vercel.app",
            "banner": "../banners/valorant.png",
            "thumbnail": "../thumbnails/valorant.png",
            "description": "Tive a ideia de consumir a API de um dos jogos mais famosos, estou renderizando algumas informações sobre o game, personagens com suas descrições, incluindo vozes e vídeos das habilidades, apresentações de todas as armas, suas especificações e os mapas presentes no jogo. Um quase completo guia do jogo."
        },
        {
            "id": 7,
            "name": "Relógio Dinâmico",
            "link": "https://renovatt.github.io/relogio-dinamico",
            "banner": "../banners/clock.png",
            "thumbnail": "../thumbnails/clock.png",
            "description": "No início fiquei fazendo vários pequenos projetos, e este foi um deles, poderia ser mais atraente, mas como foi bem no começo, foi o que consegui criar naquele momento. A ideia era replicar um relógio que segue o dia a dia de uma pessoa, acordando, indo ao trabalho, horário de almoço, voltando para casa, lazer e dormindo."
        },
        {
            "id": 8,
            "name": "Dogs",
            "link": "https://dogs-weld.vercel.app",
            "banner": "../banners/dogs.png",
            "thumbnail": "../thumbnails/dogs.png",
            "description": "Este projeto não foi algo criado por mim do zero como meus outros projetos, mas criei por estudo, aprendi bastante coisa. Ele se trata de uma rede social para cachorros criada no curso de React da Origamid."
        },
        {
            "id": 100,
            "name": "Em breve",
            "link": "/",
            "banner": "../banners/default.png",
            "thumbnail": "../thumbnails/thumbnail.png",
            "description": "Em breve, estou construindo algo."
        }
    ],
    "skills": [
        {
            "id": 1,
            "link": "https://developer.mozilla.org/pt-BR/docs/Web/HTML",
            "svg": "FaHtml5",
            "skill_name": "HTML",
            "description": "(Linguagem de Marcação de HiperTexto) é o bloco de construção mais básico da web. Define o significado e a estrutura do conteúdo da web."
        },
        {
            "id": 2,
            "link": "https://developer.mozilla.org/pt-BR/docs/Web/CSS",
            "svg": "FaCss3Alt",
            "skill_name": "CSS",
            "description": "É uma linguagem de estilo usada para descrever a apresentação de um documento escrito em HTML ou em XML incluindo várias linguagens em XML como SVG, MathML ou XHTML. O CSS descreve como elementos são mostrados na tela, no papel, na fala ou em outras mídias."
        },
        {
            "id": 3,
            "link": "https://developer.mozilla.org/pt-BR/docs/Web/JavaScript",
            "svg": "SiJavascript",
            "skill_name": "JavaScript",
            "description": " É uma linguagem leve, interpretada e baseada em objetos com funções de primeira classe, mais conhecida como a linguagem de script para páginas Web, mas usada também em vários outros ambientes sem browser, tais como node.js, Apache CouchDB e Adobe Acrobat."
        },
        {
            "id": 4,
            "link": "https://react.dev/",
            "svg": "FaReact",
            "skill_name": "React",
            "description": "É uma biblioteca para construção de interfaces de usuário. React não é um framework – nem mesmo é exclusivo para web. É utilizado com outras bibliotecas para renderização em certos ambientes."
        },
        {
            "id": 5,
            "link": "https://www.typescriptlang.org/",
            "svg": "SiTypescript",
            "skill_name": "TypeScript",
            "description": "TypeScript é uma linguagem de programação de código aberto desenvolvida pela Microsoft. É um superconjunto sintático estrito de JavaScript e adiciona tipagem estática opcional à linguagem."
        },
        {
            "id": 6,
            "link": "https://nextjs.org/blog/next-13-1",
            "svg": "SiNextdotjs",
            "skill_name": "Next.js",
            "description": "Next.js é uma estrutura da web de desenvolvimento front-end React de código aberto criada por Vercel que permite funcionalidades como renderização do lado do servidor e geração de sites estáticos para aplicativos da web baseados em React."
        },
        {
            "id": 7,
            "link": "https://git-scm.com/",
            "svg": "FaGitAlt",
            "skill_name": "Git",
            "description": "Git é o sistema de controle de versão open source mais usado no mundo atualmente! Ele é usado para controlar o histórico de alterações de arquivos e principalmente de projetos de desenvolvimento de software."
        },
        {
            "id": 8,
            "link": "https://github.com/",
            "svg": "FaGithub",
            "skill_name": "Github",
            "description": "GitHub é uma plataforma de hospedagem de código para controle de versão e colaboração . Ele permite que você e outras pessoas trabalhem juntos em projetos de qualquer lugar."
        },
        {
            "id": 9,
            "link": "https://styled-components.com/",
            "svg": "SiStyledcomponents",
            "skill_name": "Styled Components",
            "description": "Styled Components é uma biblioteca para estilizar componentes de uma aplicação web usando CSS-in-JS, ou seja, escrevendo estilos diretamente em JavaScript."
        }
    ],
    "softskills": [
        {
            "id": 1,
            "name": "Organização"
        },
        {
            "id": 2,
            "name": "Colaboração"
        },
        {
            "id": 3,
            "name": "Esforçado"
        },
        {
            "id": 4,
            "name": "Comunicação"
        },
        {
            "id": 5,
            "name": "Gosto de Aprender"
        },
        {
            "id": 6,
            "name": "Trabalho em Equipe"
        },
        {
            "id": 7,
            "name": "Dedicação"
        },
        {
            "id": 8,
            "name": "Compromisso"
        }
    ]
}